Тестовая_база_ERP_14/src/Catalogs/РЭЙ_ВидыПодтверждающихДокументов/РЭЙ_ВидыПодтверждающихДокументов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>РЭЙ_ВидыПодтверждающихДокументов</name>
  <hierarchical>true</hierarchical>
  <predefined>
    <items>
      <name>ВывозСТерриторииРФТоваровПоГТД</name>
      <description>О вывозе с территории РФ товаров с оформлением ДТ или документов, указанных в п/п 8.1.1 Инструкции №181-И, за исключением документов с кодом 03_3</description>
    </items>
    <items>
      <name>ВвозНаТерриториюРФТоваровПоГТД</name>
      <description>О ввозе на территорию РФ товаров с оформлением ДТ или документов, указанных в п/п.8.1.1 Инструкции №181-И, за исключением документов с кодом 03_4</description>
    </items>
    <items>
      <name>ОтгрузкаТоваровПриВывозеСТерриторииРФБезГТД</name>
      <description>Об отгрузке товаров при их вывозе с территории РФ без оформления ДТ или документов, указ. в п/п.8.1.2 Инструкции №181-И, за искл. док-тов с кодом 03_3</description>
    </items>
    <items>
      <name>ПолучениеТоваровПриВвозеНаТерриториюРФБезГТД</name>
      <description>О получении товаров при их ввозе на территорию РФ без оформления ДТ или документов, указ. в п/п.8.1.2 Инструкции №181-И, за искл. док-тов с кодом 03_4</description>
    </items>
    <items>
      <name>ПередачаРезидентомНаТерриторииРФТоваровИУслугНерезидентуГСМ</name>
      <description>О передаче резидентом товаров и оказании услуг нерезиденту по контрактам продажи ГСМ, МТЗ и иных товаров, указанным в п/п.4.1.2 Инструкции №181-И</description>
    </items>
    <items>
      <name>ПолучениеРезидентомЗаПределамиТерриторииРФТоваровИУслугОтНерезидентаГСМ</name>
      <description>О получении резидентом товаров и услуг от нерезидента по контрактам приобретения ГСМ, МТЗ и иных товаров, указанным в п/п.4.1.2 Инструкции №181-И</description>
    </items>
    <items>
      <name>ВыполненныеРезидентомРаботыУслугиПереданныеПрава</name>
      <description>О выполненных резидентом работах, услугах, переданных информации, результатах ИД и имуществе в аренду, за искл. документов с кодами 03_3 и 15_3</description>
    </items>
    <items>
      <name>ВыполненныеНерезидентомРаботыУслугиПереданныеПрава</name>
      <description>О выполненных нерезидентом работах, услугах, переданных информации, результатах ИД и имуществе в аренду, за искл. документов с кодом 03_4 и 15_4</description>
    </items>
    <items>
      <name>ПрощениеРезидентомОсновногоДолгаНерезиденту</name>
      <description>О прощении резидентом долга (основной долг) нерезиденту по кредитному договору</description>
    </items>
    <items>
      <name>ПрощениеНерезидентомОсновногоДолгаРезиденту</name>
      <description>О прощении нерезидентом долга (основной долг) резиденту по кредитному договору</description>
    </items>
    <items>
      <name>ЗачетВстречныхТребованийПрекращениемОбязательствНерезидентаПоВозвратуОсновногоДолга</name>
      <description>О зачете встречных однородных требований, при котором обязательства нерезидента по возврату осн. долга по кредитному договору прекращаются полностью</description>
    </items>
    <items>
      <name>ЗачетВстречныхТребованийПрекращениемОбязательствРезидентаПоВозвратуОсновногоДолга</name>
      <description>О зачете встречных однородных требований, при котором обязательства резидента по возврату осн. долга по кредитному договору прекращаются полностью</description>
    </items>
    <items>
      <name>УступкаРезидентомТребованияКНерезидентуПоВозвратуОсновногоДолга</name>
      <description>Об уступке резидентом требования к должнику-нерезиденту по возврату основного долга по кредитному договору иному лицу - нерезиденту</description>
    </items>
    <items>
      <name>УступкаНерезидентомТребованияКРезидентуПоВозвратуОсновногоДолга</name>
      <description>Об уступке нерезидентом требования к должнику-резиденту по возврату основного долга по кредитному договору в пользу иного лица - резидента</description>
    </items>
    <items>
      <name>ПереводНерезидентомСвоегоДолгаПоВозвратуОсновногоДолга</name>
      <description>О переводе нерезидентом своего долга по возврату основного долга по кредитному договору на иное лицо - резидента</description>
    </items>
    <items>
      <name>ПереводРезидентомСвоегоДолгаПоВозвратуОсновногоДолга</name>
      <description>О переводе резидентом своего долга по возврату основного долга по кредитному договору на иное лицо - нерезидента</description>
    </items>
    <items>
      <name>ПрекращениеОбязательствНерезидентаНовацией</name>
      <description>О прекращении или об изменении обязательств нерезидента по кредитному договору в связи с новацией, за искл.новации передачей ценных бумаг</description>
    </items>
    <items>
      <name>ПрекращениеОбязательствРезидентаНовацией</name>
      <description>О прекращении или об изменении обязательств резидента по кредитному договору в связи с новацией, за искл.новации передачей ценных бумаг</description>
    </items>
    <items>
      <name>ПрекращениеОбязательствНерезидентаПередачейРезидентуЦенныхБумаг</name>
      <description>О прекращении или об изменении обязательств нерезидента, посредством передачи нерезидентом резиденту векселя или иных ценных бумаг</description>
    </items>
    <items>
      <name>ПрекращениеОбязательствРезидентаПередачейНерезидентуЦенныхБумаг</name>
      <description>О прекращении или об изменении обязательств резидента посредством передачи резидентом нерезиденту векселя или иных ценных бумаг</description>
    </items>
    <items>
      <name>ИсполнениеОбязательствПоВозвратуОсновногоДолгаНерезидентаИнымЛицомРезидентом</name>
      <description>О полном или частичном исполнении обязательств по возврату основного долга нерезидента по кредитному договору иным лицом - резидентом</description>
    </items>
    <items>
      <name>ИсполнениеОбязательствПоВозвратуОсновногоДолгаРезидентаТретьимЛицомНерезидентом</name>
      <description>О полном или частичном исполнении обязательств по возврату основного долга резидента по кредитному договору третьим лицом - нерезидентом</description>
    </items>
    <items>
      <name>УвеличениеЗадолженностиПоОсновномуДолгуРезидентаПередНерезидентом</name>
      <description>Об изменении обязательств (увеличении задолженности по основному долгу резидента перед нерезидентом) по кредитному договору</description>
    </items>
    <items>
      <name>УвеличениеЗадолженностиПоОсновномуДолгуНерезидентаПередРезидентом</name>
      <description>Об изменении обязательств (увеличении задолженности по основному долгу нерезидента перед резидентом) по кредитному договору</description>
    </items>
    <items>
      <name>ИныеСпособыИсполненияОбязательствНерезидентаПередРезидентом</name>
      <description>Об иных способах исполнения обязательств нерезидента перед резидентом за исключением иных кодов видов подтверждающих документов</description>
    </items>
    <items>
      <name>ИныеСпособыИсполненияОбязательствРезидентаПередНерезидентом</name>
      <description>Об иных способах исполнения обязательств резидента перед нерезидентом за исключением иных кодов видов подтверждающих документов</description>
    </items>
    <items>
      <name>ПередачаРезидентомВЛизингИмущества</name>
      <description>О переданном резидентом в финансовую аренду (лизинг) имуществе</description>
    </items>
    <items>
      <name>ПередачаНерезидентомВЛизингИмущества</name>
      <description>О переданном нерезидентом в финансовую аренду (лизинг) имуществе</description>
    </items>
    <items>
      <name>УдержаниеБанкамиКомиссийЗаПереводДенежныхСредствПричитающихсяРезиденту</name>
      <description>Об удержании банками банковских комиссий за перевод денежных средств, причитающихся резиденту</description>
    </items>
  </predefined>
  <attributes>
    <name>НаименованиеПолное</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Возврат</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПериодическиеФиксированныеПлатежи</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
</mdclass:Catalog>

Тестовая_база_ERP_14/src/Catalogs/РЭЙ_ВидыПодтверждающихДокументов/ManagerModule.bsl
Процедура Инициализировать() Экспорт
	Макет = Справочники.РЭЙ_ВидыПодтверждающихДокументов.ПолучитьМакет("КлассификаторВидовПодтверждающихДокументов");
	
	Для т = 4 по Макет.ВысотаТаблицы Цикл
		текСсылка = Справочники.РЭЙ_ВидыПодтверждающихДокументов.НайтиПоКоду(Макет.Область(т, 1).Текст);
		Если ЗначениеЗаполнено(текСсылка) Тогда
			текОбъект = текСсылка.ПолучитьОбъект();
			текОбъект.НаименованиеПолное = Макет.Область(т, 2).Текст;
			текОбъект.Возврат = Не ПустаяСтрока(Макет.Область(т, 3).Текст);
			текОбъект.ПериодическиеФиксированныеПлатежи = Не ПустаяСтрока(Макет.Область(т, 4).Текст);
			текОбъект.Записать();
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры
